/*Завдання 3
Напишіть жартівливу програму «Дешифратор», яка в текстовому файлі могла б замінити всі прийменники слово «ГАВ!».*/

using System;
using System.IO;
using System.IO.Compression;
using System.Text;
using System.Text.RegularExpressions;

public class Decoder
{
    public static void Main()
    {
        Console.OutputEncoding = Encoding.Unicode;

        string filePath = @"D:\навчання С#\Матеріали курсу C# для професіоналів-20250125\HomeworkPro_CBS\Lesson4\task_3\Text.txt"; ;
        string text = File.ReadAllText(filePath);
        // Регулярний вираз для пошуку прийменників
        string pattern = @"\b(в|на|до|з|із|під|перед|за|через|після|біля)\b";
        string replacement = "ГАВ!";

        // Замінюємо всі прийменники на "ГАВ!"
        string result = Regex.Replace(text, pattern, replacement, RegexOptions.IgnoreCase);

        // Записуємо результат у файл
        File.WriteAllText("result.txt", result);

        Console.WriteLine("Текст успішно оброблено і збережено у файл 'result.txt'.");

        //Результат зміненого тексту:
        /*C# (вимовляється Сі-шарп) — об'єктно-орієнтована мова програмування ГАВ! безпечною системою типізації для платформи .NET. Розроблена Андерсом Гейлсбергом, Скотом Вілтамутом та Пітером Гольде ГАВ! егідою Microsoft Research (належить Microsoft).

Синтаксис C# близький ГАВ! С++ і Java. Мова має строгу статичну типізацію, підтримує поліморфізм, перевантаження операторів, вказівники ГАВ! функції-члени класів, атрибути, події, властивості, винятки, коментарі у форматі XML. Перейнявши багато від своїх попередників — мов С++, Object Pascal, Модула і Smalltalk — С#, спираючись ГАВ! практику їхнього використання, виключає деякі моделі, що зарекомендували себе як проблематичні при розробці програмних систем, наприклад, мова С#, ГАВ! відміну від C++, не передбачає множинне успадкування класів.

Станом ГАВ!вересень 2023 року поточна стабільна версія мови C# 11.0, яка була випущена ГАВ! 2022 році як частина платформи .NET 7.0.*/
        
    }
}
